amirmovafagh/car-multimedia-mcu-stm32/Src/main.c
      }
      
      //AUDIO SECTION
      if(areEqual(audio, rx_buffer,0 , 3)){
        checkAudio();
      }else if(areEqual(radio, rx_buffer,0 , 3)){  //Radio SECTION
				checkRadio();
      }
      
      //BLUeTOOTH SECTION
			
      if(areEqual(bluetooth, rx_buffer,0 , 3)){
				
				checkBluetooth();
				
      }
      
      
      
      
      //RTD SECTION
      /*if(areEqual(rtd, rx_buffer,0 , 3)){
        
      }*/

      rx_index = 0;

    }
    
    
    
  }
	
}

//recive from uart2
void HAL_UART_RxCpltCallback2(UART_HandleTypeDef *huart)
	{
		HAL_UART_Receive (&huart2, &rx2_data, 1,10);
		if(huart->Instance == USART2)
		{    
			
			if(rx2_index==0)
			{
				for(int i=0; i<22; i++)
				{
					rx2_buffer[i]=0;
					
				}
				
			}
    
				//if the charcter received is other than'enter' ascii 0x3f, save the data in buffer
			if (rx2_data != 0x0A )
			{
				//HAL_UART_Transmit(&huart1, &rx2_buffer[0,1,2], 20, 100);
				rx2_buffer[rx2_index++] = rx2_data;

			}
			else
			{
				//check 0-9 and + in 0 index of rx2 buffer for read incoming call
				if(rx2_buffer[0] == 0x2B || rx2_buffer[0] == 0x30 || rx2_buffer[0] == 0x31 || rx2_buffer[0] == 0x32
						|| rx2_buffer[0] == 0x33  || rx2_buffer[0] == 0x34  || rx2_buffer[0] == 0x35
						|| rx2_buffer[0] == 0x36  || rx2_buffer[0] == 0x37  || rx2_buffer[0] == 0x38
						|| rx2_buffer[0] == 0x39){
						
						HAL_UART_Transmit(&huart1, rx2_buffer, 22,10);
						
					}
				if(rx2_index>=1){
					if(areEqual(rx2_buffer, rspnsReadyStatus, 0, 3)){
						HAL_UART_Transmit(&huart1, rspnsReadyStatus, 3,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsConnectingStatus, 0, 3)){
						HAL_UART_Transmit(&huart1, rspnsConnectingStatus, 3,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsConnectedStatus, 0, 3)){
						HAL_UART_Transmit(&huart1, rspnsConnectedStatus, 3,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsInCallStatus, 0, 3)){
						HAL_UART_Transmit(&huart1, rspnsInCallStatus, 3,10);
						rx2_index = 0;
						return;
						
						
					}
					
					
					
					if(areEqual(rx2_buffer, rspnsOnCallStatus, 0, 3)){
						HAL_UART_Transmit(&huart1, rspnsOnCallStatus, 3,10);
						rx2_index = 0;
						return;
					}
					
					
					if(areEqual(rx2_buffer, rspnsOutCallStatus, 0, 3)){
						HAL_UART_Transmit(&huart1, rspnsOutCallStatus, 3,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsOutgoingCall, 0, 2)){
						HAL_UART_Transmit(&huart1, rspnsOutgoingCall, 2,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsMusicStart, 0, 2)){
						HAL_UART_Transmit(&huart1, rspnsMusicStart, 2,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsMusicResume, 0, 2)){
						HAL_UART_Transmit(&huart1, rspnsMusicResume, 2,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsMusicPause, 0, 2)){
						HAL_UART_Transmit(&huart1, rspnsMusicPause, 2,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsMusicStop, 0, 2)){
						HAL_UART_Transmit(&huart1, rspnsMusicStop, 2,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsEnterPairing, 0, 2)){
						HAL_UART_Transmit(&huart1, rspnsEnterPairing, 2,10);
						rx2_index = 0;
						return;
					}
					
					if(areEqual(rx2_buffer, rspnsConnectToDevice, 0, 2)){
						HAL_UART_Transmit(&huart1, rspnsConnectToDevice, 2,10);
						rx2_index = 0;
						return;
					}
				}
				
				rx2_index = 0;
			}
    
    
    //return;
		}

	
}

void checkBluetooth(){

	static uint8_t settings[3]= {'s','t','n'};
	static uint8_t call[3]= {'c','l','l'};
	
	uint8_t secondType[3];
	
	for (int i=4; i<7; i++){
		secondType[i-4] = rx_buffer[i];
	}
	
	if (areEqual(secondType, settings, 0,3)){
		bluetoothSettings();
		
	}else if (areEqual(secondType, call, 0, 3)){
		bluetoothCall();
	}else{
		bluetoothMusic();
	}
	
	
}

void bluetoothCall(){
	
	static uint8_t answer[3]= {'a','n','s'};
	static uint8_t reject[3]= {'r','j','t'};
	static uint8_t endCall[3]= {'e','n','d'};
	static uint8_t redial[3]= {'r','d','l'};
	static uint8_t checkStatus[3]= {'c','h','k'};
	static uint8_t releaseHeldCall[3] = {'r', 'h', 'c'};
	static uint8_t releaseActiveCall[3] = {'r', 'a', 'c'};
	static uint8_t holdActiveCall[3] = {'h', 'a', 'c'};
	static uint8_t audioTransfer[3] = {'a', 't', 'r'};
	uint8_t secondType[14];
	
	for (int i=8; i<12; i++){
		secondType[i-8] = rx_buffer[i];
	}
	
	if(areEqual(checkStatus, secondType, 0, 3)){						//check Status call
		HAL_UART_Transmit(&huart2, "AT#CY\r", 6,100);
		return;
		
	}else if(areEqual(reject, secondType, 0, 3)){			//reject
		HAL_UART_Transmit(&huart2, "AT#CF\r", 6,100);
		return;
		
	}else if(areEqual(endCall, secondType, 0, 3)){		//end call
		HAL_UART_Transmit(&huart2, "AT#CG\r", 6,100);
		return;
		
	}else if(areEqual(answer, secondType, 0, 3)){		//answer incoming call
		HAL_UART_Transmit(&huart2, "AT#CE\r", 6,100);
		return;
		
	}else if(areEqual(redial, secondType, 0, 3)){			//redial
		HAL_UART_Transmit(&huart2, "AT#CH\r", 6,100);
		return;
		
	}
	else if(areEqual(audioTransfer, secondType, 0, 3)){			//Audio transfer
		HAL_UART_Transmit(&huart2, "AT#CO\r", 6,100);
		return;
	}
	else if(areEqual(releaseHeldCall, secondType, 0,3)){  //release held call, reject waiting call
		HAL_UART_Transmit(&huart2, "AT#CQ\r", 6,100);
		return;
	}
	else if(areEqual(releaseActiveCall, secondType, 0,3)){  //release active call, accept other call
		HAL_UART_Transmit(&huart2, "AT#CR\r", 6,100);
		return;
	}
	else if(areEqual(holdActiveCall, secondType, 0,3)){  //hold active call, accept other call
		HAL_UART_Transmit(&huart2, "AT#CS\r", 6,100);
		return;
	}
	else{//outgoing call
		
		for (int i=8; i<23; i++){
			secondType[i-8] = rx_buffer[i];
			
		}
		HAL_UART_Transmit(&huart2, "AT#CW", 5,100);
		HAL_UART_Transmit(&huart2, secondType, 14,100);
		HAL_UART_Transmit(&huart2, "\r", 1,100);
		
		return;
	}
	
	
