amirmovafagh/car-multimedia-mcu-stm32/Src/main.c
}

void bluetoothMusic(){
	{
	static uint8_t decreaseVolume[3]= {'v','d','n'};
	static uint8_t increaseVolume[3]= {'v','u','p'};
	static uint8_t muteMic[3]= {'m','u','t'};
	static uint8_t playPause[3] = {'p', 'p', 'p'};
	static uint8_t stop[3] = {'s', 't', 'p'};
	static uint8_t forward[3]= {'f','w','d'};
	static uint8_t backward[3]= {'b','w','d'};
	uint8_t secondType[3];
	
	for (int i=8; i<12; i++){
		secondType[i-8] = rx_buffer[i];
	}
	
	if(areEqual(decreaseVolume, secondType, 0, 3)){ //volume down
		HAL_UART_Transmit(&huart2, "AT#VD\r", 6,100);
		return;
	}
	else if(areEqual(increaseVolume, secondType, 0, 3)){  //volume Up
		HAL_UART_Transmit(&huart2, "AT#VU\r", 6,100);
		return;
	}
	else if(areEqual(muteMic, secondType, 0, 3)){	//TOGGLE MIC
		HAL_UART_Transmit(&huart2, "AT#CM\r", 6,100);
		return;
	}
	else if(areEqual(playPause, secondType, 0, 3)){  //play , pause
		HAL_UART_Transmit(&huart2, "AT#MA\r", 6,100);
		return;
	}
	else if(areEqual(stop, secondType, 0, 3)){  //stop
		HAL_UART_Transmit(&huart2, "AT#MC\r", 6,100);
		return;
	}
	else if(areEqual(forward, secondType, 0, 3)){  //forward
		HAL_UART_Transmit(&huart2, "AT#MD\r", 6,100);
		return;
	}
	else if(areEqual(backward, secondType, 0, 3)){ //backward
		HAL_UART_Transmit(&huart2, "AT#ME\r", 6,100);
		return;
	}
	
	}
}
void bluetoothSettings(){
	static uint8_t enterPairing[3]= {'p','o','n'}; 
	static uint8_t cancelPairing[3]= {'p','o','f'}; 
	static uint8_t enableAutoConn[3]= {'e','a','c'}; 
	static uint8_t disableAutoConn[3]= {'d','a','c'}; 
	static uint8_t enableAutoAnswer[3]= {'e','a','n'}; 
	static uint8_t disableAutoAnswer[3]= {'d','a','n'}; 
	uint8_t secondType[3];
	
	for (int i=8; i<12; i++){
		secondType[i-8] = rx_buffer[i];
	}
	
	//start and stop pairing mode
	if(areEqual(secondType, enterPairing, 0,3)){
		HAL_UART_Transmit(&huart2, "AT#CA\r", 6,100);
		
		return;
	}else if(areEqual(secondType, cancelPairing, 0,3)){
		HAL_UART_Transmit(&huart2, "AT#CB\r", 6,100);
		HAL_UART_Transmit(&huart1, "Cancel pairing mode", 19,100);
		return;
	}
	
	//enable and disable Auto connect mode
	if(areEqual(secondType, enableAutoConn, 0,3)){
		
		HAL_UART_Transmit(&huart2, "AT#MG\r", 6,100);
		HAL_UART_Transmit(&huart1, "Enable Auto connect", 19,100);
		return;
	}else if(areEqual(secondType, disableAutoConn, 0 , 3)){
		HAL_UART_Transmit(&huart2, "AT#MH\r", 6,100);
		HAL_UART_Transmit(&huart1, "Disable Auto connect", 20,100);
		return;
	}
	
	//enable and disable Auto Answer mode
	if(areEqual(secondType, enableAutoAnswer, 0,3)){
		
		HAL_UART_Transmit(&huart2, "AT#MP\r", 6,100);
		HAL_UART_Transmit(&huart1, "Enable Auto Answer", 18,100);
		return;
	}else if(areEqual(secondType, disableAutoAnswer, 0 , 3)){
		HAL_UART_Transmit(&huart2, "AT#MQ\r", 6,100);
		HAL_UART_Transmit(&huart1, "Disable Auto Answer", 19,100);
		return;
	}
	
	
}

bool areEqual(uint8_t arr1[], uint8_t arr2[], int i, int n)
{
    // Linearly compare elements
    for (i; i<n; i++){
         if (arr1[i] != arr2[i]){
						//HAL_IWDG_Refresh(&hiwdg);
						return false;
				 }
			 }         
    // If all elements were same.
    return true;
}

void checkMode(){
	if(checkDeviceI2cConnection(0x44<<1)){
		
		
		static uint8_t aux[3]={'a','u','x'};
		uint8_t secondType[3];
	
		for(int i=4; i<7; i++){
			secondType[i-4]=rx_buffer[i];
		}
		HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 1);  // mute befor change mode
		if(areEqual(secondType, radio, 0, 3)){
		
			HAL_UART_Transmit (&huart1, secondType, 3,100);
		
			frq2=94000000;
			tea5767Setfrequency(frq2);
			buffer[5]=66;	
			HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
		}else if(areEqual(secondType, aux, 0, 3)){
			buffer[5]=64;	
			HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
			HAL_UART_Transmit (&huart1, "AUX", 3,100);
		}else{
			buffer[5]=65;	
			HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
			HAL_UART_Transmit (&huart1, "pin", 3,100);
		}
		HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 0);
		}else{ HAL_UART_Transmit (&huart1, "modProb", 7,10);
			
		}
		
}

void checkAudio(){                         //Audio Module settings
	if(checkDeviceI2cConnection(0x44<<1)){
		
		static uint8_t volume[3] ={'v','o','l'};
		static uint8_t vol_lf[3] ={'v','l','f'};
		static uint8_t vol_rf[3] ={'v','r','f'};
		static uint8_t vol_lr[3] ={'v','l','r'};
		static uint8_t vol_rr[3] ={'v','r','r'};
		static uint8_t vol_bas[3] ={'b','a','s'};
		static uint8_t vol_treble[3] ={'t','b','l'};
		static uint8_t vol_loud[3] ={'l','o','d'};
		static uint8_t brightness[3] ={'b','r','g'};
		uint8_t secondType[4];
		
		for(int i=4; i<7; i++){
			secondType[i-4]=rx_buffer[i];
		}
		if(areEqual(secondType, volume, 0, 3)){ //change volume
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			
			buffer[0]= arrayToInt(secondType);
			HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);		//+++++++++++++++++++++++++++++++++++++++++++++++
			HAL_UART_Transmit (&huart1, "changed vol", 11,100);
			if(buffer[0]==63){
				HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 1);
				//HAL_GPIO_WritePin(muto_GPIO_Port,stbo_Pin, 1);	 
			}else{
				HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 0);
				//HAL_GPIO_WritePin(muto_GPIO_Port,stbo_Pin, 0);	 
			 
			}
			return;
		}else if (areEqual(secondType, brightness, 0, 3)){ //Brightness
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			int i= arrayToInt(secondType);
    	TIM2->CCR1 = 70 + i;
			return;
			
		}
		else if(areEqual(secondType, vol_lf, 0, 3)){ //speaker left front
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			buffer[1]= arrayToInt(secondType);
			HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
			return;
			
		}
		else if(areEqual(secondType, vol_rf, 0, 3)){ //speaker right front
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			buffer[2]= arrayToInt(secondType);
			HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);	
			return;
		}else if(areEqual(secondType, vol_lr, 0, 3)){ //speaker left rear
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			buffer[3]= arrayToInt(secondType);
    	HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
			return;
		}else if (areEqual(secondType, vol_rr, 0, 3)){ //speaker right rear
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			buffer[4]= arrayToInt(secondType);
    	HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
			return;
			
		}else if (areEqual(secondType, vol_bas, 0, 3)){ //change bas
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			buffer[6]= arrayToInt(secondType);
    	HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
			return;
			
		}else if (areEqual(secondType, vol_loud, 0, 3)){ //change Loud
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			//		buffer[0]= arrayToInt(secondType);
    		//	HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
						return;

		}else { 																			 //change treble
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			buffer[7]= arrayToInt(secondType);
			HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);
			return;

