amirmovafagh/car-multimedia-mcu-stm32/Src/main.c
		}
	}else HAL_UART_Transmit (&huart1, "audProb", 7,10);
  
 
}

void checkRadio(){									//RADIO Module settings
	if(checkDeviceI2cConnection(0x60<<1)){
		uint8_t frequency[3]={'f','r','q'};
		uint8_t secondType[4];
			
		for(int i=4; i<7; i++){
			secondType[i-4]=rx_buffer[i];
		}
		
		if(areEqual(secondType, frequency, 0, 3)){ //change frequency
			for(int i=8; i<12; i++){
				secondType[i-8]=rx_buffer[i];
			}
			HAL_UART_Transmit (&huart1, "radiFrq", 7,10);
			frq2=arrayToInt(secondType);
			frq2=frq2*100000;
			
			tea5767Setfrequency(frq2);
			HAL_UART_Transmit (&huart1, "okk frq", 3,100);

		}
	}
	
}

int arrayToInt(uint8_t mArr[]){
  int b,o,n,m,k;
	
  if(mArr[1]==0x00){
    m = (mArr[0]-'0');
    k = m;
  }else if(mArr[2]==0x00){
		n = (mArr[0]-'0')*10;
    m = mArr[1]-'0';
    k = n+m;
	}else if(mArr[3]==0x00){
		o = (mArr[0]-'0')*100;
		n = (mArr[1]-'0')*10;
    m = mArr[2]-'0';
    k = o+n+m;	
	}else {
		b = (mArr[0]-'0')*1000;
		o = (mArr[1]-'0')*100;
		n = (mArr[2]-'0')*10;
    m = mArr[3]-'0';
    k = b+o+n+m;	
	}
  d=k;
  return k;
}

bool checkDeviceI2cConnection(uint16_t DevAddress){
	//check I2c connection situation with pt2313 module
	init=HAL_I2C_IsDeviceReady(&hi2c1,DevAddress,1,100);
	if(init == HAL_OK){
		return true;
	}else return false;
}



/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
int ADC_result[2],ADC_buffer[2];
int ADC_average=0;
		int ADC_sum=0;
		int ADC_counter=0;
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
	
	if(hadc->Instance == ADC1){
		
		ADC_result[0] = ADC_buffer[0];
		ADC_result[1] = ADC_buffer[1];
		if(ADC_result[0] < 3350){
			
				ADC_sum += ADC_result[0];
				ADC_counter = ADC_counter++;
				ADC_result[0] =ADC_sum / ADC_counter;
			if(ADC_counter > 200){
				uint8_t ADC_buffer_send[4];
				for(int i=0; i<3000000 ; i++){}
				ADC_buffer_send[3] = (( ADC_result[0] / 1 ) % 10) + '0';
				ADC_buffer_send[2] = (( ADC_result[0] / 10 ) % 10) + '0';
				ADC_buffer_send[1] = (( ADC_result[0] / 100 ) % 10) + '0';
				ADC_buffer_send[0] = (( ADC_result[0] / 1000 ) % 10) + '0';
				HAL_UART_Transmit (&huart1, ADC_buffer_send, 4,100);
			}
			
			
			HAL_IWDG_Refresh(&hiwdg);
		}else {
		ADC_sum = 0;
		ADC_counter = 0;
		ADC_result[0] = 0;
		}
	}
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
HAL_GPIO_WritePin( GPIOB, GPIO_PIN_14, 1);
//	HAL_GPIO_WritePin(ldro_GPIO_Port,ldro_Pin, 1);


  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  MX_USART2_UART_Init();
  MX_ADC1_Init();
  MX_IWDG_Init();
  MX_TIM2_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */
	HAL_ADC_Start_DMA(&hadc1, ADC_buffer, 2);
	__HAL_IWDG_START(&hiwdg);
	
	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1); //start timer2 channel_1 as pwm
	TIM2->CCR1 = 130;//pwm value from 0 to 65535

//__HAL_UART_ENABLE_IT(&huart1,UART_IT_TC);
 __HAL_UART_ENABLE_IT(&huart1,UART_IT_RXNE);//ssssssssssssssssssssssssssssssssssssssssssssssssssss
 __HAL_UART_ENABLE_IT(&huart2,UART_IT_RXNE);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
		/*HAL_UART_Transmit(&huart1,"usart1 ok",11,2);
		HAL_UART_Transmit(&huart2,"usart2 ok",11,2);
		HAL_GPIO_WritePin( GPIOB, GPIO_PIN_1, 1);
		HAL_GPIO_WritePin( GPIOB, GPIO_PIN_0, 1);
		HAL_Delay(2000);*/
		
		
//HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 0);		
HAL_GPIO_WritePin(stbo_GPIO_Port,stbo_Pin, 0);

		
		
HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 1);		
HAL_GPIO_WritePin(stbo_GPIO_Port,stbo_Pin, 0);

HAL_GPIO_WritePin(enpo_GPIO_Port,enpo_Pin, 0);
	 HAL_GPIO_WritePin(enho_GPIO_Port,enho_Pin, 0);

				buffer[0]=31;
	buffer[1]=208;//192 223
	buffer[2]=240;//224 255
	buffer[3]=144;//128 159
	buffer[4]=176;//160 191
	buffer[5]=66;//64aux  65raspbery  66radio
	buffer[6]=96;
	buffer[7]=112;
 HAL_I2C_Master_Transmit(&hi2c1,0x44<<1,buffer,7,2);	
    

//	frq2=88000000;
  while (1)
  {
		
		//ADCresult = 4000;
		HAL_IWDG_Refresh(&hiwdg);
		//HAL_Delay(5000); //check watchDog
		/*=== start adc ===*/
		//HAL_ADC_Start(&hadc1);         
		
		
		

		//readAdc = HAL_ADC_PollForConversion(&hadc1,100);
		 
		/*if(readAdc == HAL_OK){ 
			
		  temp_val = HAL_ADC_GetValue(&hadc1);
		}*/
		
		//HAL_ADC_PollForConversion(&hadc2, 100);
		//ADCresult = HAL_ADC_GetValue(&hadc2);
		
		
		
		//HAL_ADC_Stop(&hadc1); 
		//HAL_ADC_Stop(&hadc2);
		//temperature = ((temp_val-1.43)/4.3)+25;
		
	/*	acciPinState = HAL_GPIO_ReadPin(GPIOA,acci_Pin);
	if(acciPinState == GPIO_PIN_RESET)//GPIO_PIN_1
		{
				HAL_GPIO_WritePin(enpo_GPIO_Port,enpo_Pin, 0);
	 HAL_GPIO_WritePin(enho_GPIO_Port,enho_Pin, 0);		
	HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 0);		
HAL_GPIO_WritePin(stbo_GPIO_Port,stbo_Pin, 0);
    
			
  }else{
		
    HAL_GPIO_WritePin(enpo_GPIO_Port,enpo_Pin, 1);
	 HAL_GPIO_WritePin(enho_GPIO_Port,enho_Pin, 1);		
	HAL_GPIO_WritePin(muto_GPIO_Port,muto_Pin, 1);		
	HAL_GPIO_WritePin(stbo_GPIO_Port,stbo_Pin, 1);	
	}
	
	rcaiPinState = HAL_GPIO_ReadPin(GPIOA,rcai_Pin);
	if(rcaiPinState == GPIO_PIN_RESET)
	{
		
	}*/

	



//
	//HAL_GPIO_TogglePin(ldgo_GPIO_Port,ldgo_Pin);
//		HAL_GPIO_TogglePin(ldro_GPIO_Port,ldro_Pin);	
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
	
  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

